# 타이타닉 데이터 연습문제

타이타닉 데이터는 다음과 같은 속성으로 이루어져 있다.

- **PassengerId** : 승객번호
- **Survived**: 생존여부 1(생존), 0(사망)으로 표현됨.  
- **Pclass**: 티켓의 클래스 1 = 1st, 2 = 2nd, 3 = 3rd 클래스
- **Name** : 이름
- **Sex**	성별	male, female 
- **Age**	나이	
- **SibSp**	함께 탑승한 형제와 배우자의 수	
- **Parch**	함께 탑승한 부모, 아이의 수
- **Ticket**	티켓 번호	
- **Fare**	탑승료	
- **Cabin**	객실 번호	
- **Embarked**	탑승 항구	C = Cherbourg, Q = Queenstown, S = Southampton

1. 타이타닉 데이터를 읽어 들인다.

In [ ]:
import pandas as pd
df = pd.read_csv('../data/titanic.csv')

2. 읽어들인 데이터를 확인한다.
- head
- info
- etc.

In [ ]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

3. 요약통계량을 확인하시오.(describe)

In [ ]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

3. "FamilySize"라는 컬럼의 추가하시오. 
> FamilySize = SibSp + Parch

In [ ]:
df['FamilySize'] = df['SibSp'] + df['Parch']
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

4. 생존자와 사망자의 인원수를 출력해 보시오.(0:사망 1:생존)
5. 등급별 인원수를 출력하시오.
6. 성별 인원수를 출력하시오.

In [ ]:
# 생존/사망자 인원수 0:사망 1:생존
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [ ]:
# 등급별인원수
df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [ ]:
# 성별 인원수
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

7. 전체 생존율, 성별 생존율, 등급별 생존율, 성별/등급별 생존율을 출력해 보시오.  
(힌트: mean()함수를 활용)

In [ ]:
# 전체 생존율, 성별 생존율, 등급별 생존율
# 전체 생존율
df['Survived'].mean()

0.3838383838383838

In [ ]:
# 성별 생존율
df.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [ ]:
# 등급별 생존율
df.groupby('Pclass')['Survived'].mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [ ]:
# 성별+등급별 생존율
df.groupby(['Pclass','Sex'])['Survived'].mean()

Pclass  Sex
1       female    0.968085
        male      0.368852
2       female    0.921053
        male      0.157407
3       female    0.500000
        male      0.135447
Name: Survived, dtype: float64

8. 나이에 따른 생존율을 비교해 봅시다.  
10세 미만의 생존율과 60세 이상의 생존율을 출력해 보시오.

In [ ]:
# 10세미만의 생존율
df[df['Age'] < 10]['Survived'].mean()

0.6129032258064516

In [ ]:
# 60세이상의 생존율
df[df['Age'] >= 60]['Survived'].mean()

0.2692307692307692

9. 동반 가족이 있는지 여부에 따른 생존율을 비교해 봅시다.  
FamilySize < 1인 경우와 FamilySize >= 1인 경우의 생존율 출력해 보시오.

In [ ]:
# FamilySize < 1인 경우와 FamilySize >= 1인 경우의 생존율 비교
# FamilySize < 1인 경우
df[df['FamilySize'] < 1]['Survived'].mean()

0.30353817504655495

In [ ]:
# FamilySize >= 1인 경우
df[df['FamilySize'] >= 1]['Survived'].mean()

0.5056497175141242

10. 타이타닉호의 생존율과 관련된 요소와 관련된 결론을 작성해 보시오.

# 결론
타이타닉호의 생존율과 관련된 요소는 다음과 같다.

- 1등급(Pclass)일수록 생존율이 높다.
- 남성보다는 여성의 생존율이 높다.
- 노인보다 어린이의 생존율이 높다.
- 혼자 탑승한 승객보다는 가족과 탑승한 승객의 생존율이 높다.